function Rule(props){
    return(
        <div>
            <div className="head">
                <button className="button3" onClick={props.onClickReturn}>Return</button>
            </div>
            <div>
                <h1>使用上下左右鍵移動。</h1>
                <h1>若蛇的頭部撞到邊界、自己、敵人或障礙物(灰色方塊)時遊戲結束。</h1>
                <h1>一般方塊:</h1>
                <h1>點數: 分數+1, 長度+1, 隨機產生一個障礙物</h1>
                <h1>障礙物: 碰觸到即遊戲結束</h1>
                <h1>道具:</h1>
                <h1>加分(黃色方塊): 分數+5, 長度不變</h1>
                <h1>成長(綠色方塊): 分數+3, 長度+10</h1>
                <h1>蛻皮(紫色方塊): 分數+3, 長度變1, 蛇身全部變成障礙物</h1>
                <h1>加速(青色方塊): 分數+3, 長度不變 (僅限單人)</h1>
                <h1>減速(白色方塊): 分數+0, 長度不變 (僅限單人)</h1>
                <h1>迴轉(藍色方塊): 分數+3, 長度不變, 頭尾調換</h1>
                <h1>場上永遠會有三個點數，而每吃掉三個點數就會出現一個道具</h1>
                <h1>在多人模式，玩家死亡會變成障礙物</h1>
            </div>
        </div>
    )
}

export default Rule;